// © Copyright 2004-2008, 2015 HP Development Company, L.P.

TaskName = "Update Firmware";

// Errors
FileOpenError = "Cannot open the file %@";
FileOpenErrorExplanation = "This file is either corrupted or it may have been moved to another location, renamed or deleted. Please check file location or select other file and try again.";
PrintChannelOpenError = "Cannot open a printer channel";
PrintChannelOpenErrorExplanation = "Please check that your printer is connected and turned on, then try again.";
SendDataError = "Cannot send data to the printer";
SendDataErrorExplanation = "Please check that your printer is connected and turned on, then try again.";

SomePenErrorTitle = "Cannot update firmware";
DoorOpenMsg = "Cannot update firmware because a cover is open. Please close all covers on the printer.";

// Aquamarine Errors
FileCheckError = "Cannot update firmware";
FileCheckErrorExplanation = "Firmware package not valid. Please select other file and try again.";

OkButton = "Ok";
CancelButton = "Cancel";
FirmwareUpdateTitle = "Firmware Update";
FirmwareUpdateDeviceState = "Printing";
FirmwareUpdateCancelingDeviceState = "Canceling";

// Great Wall Messages
PrinterIdleWarning = "The Firmware update could fail if your printer is busy (for example printing a job or calibrating).\n\nPlease, check that your printer is idle before proceeding with the firmware update process.";
UpdateSuccessful = "The firmware file has been successfully uploaded and your printer is about to be updated.\n\nOnce the Firmware update has been completed, your printer will automatically reboot.";
InvalidPackage = "There were problems with the firmware file and the firmware update process has not been successful. The problem may have been caused by a transmission error.\n\nPlease, try the firmware update process again.\nIf the problem persists, please contact HP Support.";
FailedDependencies = "The Firmware update process could not be successfully completed because of a dependencies problem.\n\nThe current Firmware version is %@, and you are trying to install %@.\n\nPlease, visit the following Web page to find the appropriate update package for this printer:\n%@.";
NotNow = "The firmware update has not been successfully performed because the printer is busy (for example processing or printing a job).\n\nPlease, check that your printer is idle and perform the firmware update again.";
TransmissionError = "There were some problems with the transmission that caused the firmware update not to be successfully performed.\n\nPlease, check your printer's connection and perform the Firmware update again.";
LicenseNotAccepted = "The firmware update has not been performed because the license has not been accepted.";
FatalError = "There were problems that prevented the firmware update process to be successfully completed.\n\nIf the problem persists, please contact HP support.";

// layout
TaskTitle = "Update Firmware";
TaskDescription = "Select a file containing a firmware update and transfer that file to the printer to update it.";
FileNameTitle = "File Name:";
FileNameField = "<Not selected>";
ChooseButton = "Choose…";
UpdateButton = "Update";
ProgressPanel = "Updating Progress";
FirmwareUpdateProcessTitle = "Updating…";
